       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
      
      *SEÇÃO DE CONFIGURAÇÃO DO COMPUTADOR , QUE CONSISTE EM DOIS PONTOS
      *ONDE O PROGRAMA FOI COMPILADO E ONDE ELE FOI EXECUTADO 
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
              SOURCE-COMPUTER.
              OBJECT-COMPUTER.

      *SEÇÃO QUE FORNECE INFORMÇÕES DE ARQUIVOS QUE VÃO SER USADOS PELO 
      *PROGRAMA, CONSISTE EM CONTROLE DE ARQUIVO = ONDE FORNECE 
      *SOBRE CONJUNTOS DE DADOS EXTERNOS UTILIZADOS NO PROGRAMA.
      *I-O CONTROL: FORNECE INFORMAÇÕES DE ARQUIVOS UTILIZADOS NO
      *PROGRAMA 
       INPUT-OUTPUT SECTION. 
              FILE-CONTROL.
              SELECT FILEN ASSIGN TO DDNAME
              ORGANIZATION IS SEQUENTIAL.


       DATA DIVISION.
       FILE SECTION.
       FD FILEN.
       01 NAME PIC X(20).

       WORKING-STORAGE SECTION.
       01 WS-STUDENT PIC X(30).
       01 WS-ID PIC 9(5).

       LOCAL-STORAGE SECTION.
       01 LS-CLASS PIC 9(3).

       LINKAGE SECTION.
       01 LS-ID PIC 9(5).



       


       PROCEDURE DIVISION.
              DISPLAY "Executing COBOL ".
       STOP RUN.


