       IDENTIFICATION DIVISION.
       PROGRAM-ID. CADASTRO_CLIENTES.
       
       AUTHOR. VICTOR.
       INSTALLATION. COBOL DEVELOPMENT CENTER.
       DATE-WRITTEN. 01/01/08.
       DATE-COMPILED. 01/01/08.
       SECURITY. NON-CONFIDENTIAL.
       
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-3081.
       OBJECT-COMPUTER. IBM-3081.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DADOS-CLIENT-OUT ASSIGN TO 'DADOS_SAIDA.txt'
           ORGANIZATION IS LINE SEQUENTIAL

       DATA DIVISION.
       FILE SECTION.
       FD ARQUIVO-CLIENTES.
       01 REGISTRO-CLIENTE.
           05 CODIGO-CLIENTE PIC X(10).
           05 VIRGULA1 PIC X(01).
           05 NOME-CLIENTE PIC X(50).
           05 VIRGULA2 PIC X(01).
           05 ENDERECO-CLIENTE PIC X(100).
           05 VIRGULA3 PIC X(01).
           05 TELEFONE-CLIENTE PIC X(15).
       
       WORKING-STORAGE SECTION.
       01 CODIGO-CLIENTE-NOVO PIC X(10).
       01 NOME-CLIENTE-NOVO PIC X(50).
       01 ENDERECO-CLIENTE-NOVO PIC X(100).
       01 TELEFONE-CLIENTE-NOVO PIC X(15).
       01 CONTINUAR-INSERCAO PIC X(01) VALUE 'N'.
       
       
       PROCEDURE DIVISION.

       MAIN-PROCEDURE.
       OPEN OUTPUT DADOS-CLIENT-OUT

       PERFORM UNTIL CONTINUAR-INSERCAO = 'S'

           DISPLAY "Informe o Codigo do Cliente: "
           ACCEPT CODIGO-CLIENTE-NOVO.
       
           DISPLAY "Informe o Nome do Cliente: "
           ACCEPT NOME-CLIENTE-NOVO.
       
           DISPLAY "Informe o Endereco do Cliente: "
           ACCEPT ENDERECO-CLIENTE-NOVO.
       
           DISPLAY "Informe o Telefone do Cliente: "
           ACCEPT TELEFONE-CLIENTE-NOVO.
       
           MOVE CODIGO-CLIENTE-NOVO TO CODIGO-CLIENTE.
           MOVE NOME-CLIENTE-NOVO TO NOME-CLIENTE.
           MOVE ENDERECO-CLIENTE-NOVO TO ENDERECO-CLIENTE.
           MOVE TELEFONE-CLIENTE-NOVO TO TELEFONE-CLIENTE.
           
           WRITE REGISTRO-CLIENTE 
             
           ACCEPT  CONTINUAR-INSERCAO


       END-PERFORM
       CLOSE DADOS-CLIENT-OUT
           
       
       STOP RUN.