       IDENTIFICATION DIVISION.
       PROGRAM-ID. CLIENTE.
       AUTHOR. "Victor".
       DATE-WRITTEN. "11/01/2024".
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY DADOS-CLIENTE.
        01 WS-DADOS-CLIENTE-CONJUGE.
                02 WS-CLI-MATRICULA PIC 9(5).
                02 WS-CLI-NAME.
                    03 WS-PRIMEIRO-NOME-CLI PIC X(10).
                    03 WS-SOBRENOME-CLI PIC X(10).
                02 WS-ENDERECO.
                    03 WS-RUA-CLI PIC X(20).
                    03 WS-BAIRRO-CLI PIC X(20).
                    03 WS-CIDADE-CLI PIC X(20).
                    03 WS-CEP-CLI PIC 9(7).
        PROCEDURE DIVISION.
            MOVE 12345 TO WS-CLI-MATRICULA OF WS-DADOS-CLIENTE
            MOVE 12346 TO WS-CLI-MATRICULA OF WS-DADOS-CLIENTE-CONJUGE
            MOVE 'RUA OURO PRETO 611' TO WS-RUA-CLI OF WS-DADOS-CLIENTE
            MOVE 'RUA OURO PRETO 611' TO WS-RUA-CLI OF WS-DADOS-CLIENTE-CONJUGE


            DISPLAY 'MATRICULA CLIENTE:' 
                WS-CLI-MATRICULA OF WS-DADOS-CLIENTE 
            DISPLAY 'MATRICULA CLIENTE CONJUGE:' 
                WS-CLI-MATRICULA OF WS-DADOS-CLIENTE-CONJUGE
            DISPLAY 'ENDERECO CLIENTE:'
                WS-RUA-CLI OF WS-DADOS-CLIENTE
            DISPLAY 'ENDERECO CLIENTE CONJUGE:'
                WS-RUA-CLI OF WS-DADOS-CLIENTE-CONJUGE

    
            STOP RUN.
