       01 WS-DADOS-CLIENTE.
           02 WS-CLI-MATRICULA PIC 9(5).
           02 WS-CLI-NAME.
               03 WS-PRIMEIRO-NOME-CLI PIC X(10).
               03 WS-SOBRENOME-CLI PIC X(10).
           02 WS-ENDERECO.
               03 WS-RUA-CLI PIC X(20).
               03 WS-BAIRRO-CLI PIC X(20).
               03 WS-CIDADE-CLI PIC X(20).
               03 WS-CEP-CLI PIC 9(7).
               