         IDENTIFICATION DIVISION.
       PROGRAM-ID. TESTE.
       AUTHOR. "Victor".
       DATE-WRITTEN. "11/01/2024".
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
           STOP RUN.
        